---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Dispose
source: html/c01d3299-a6fa-6e92-98ef-1ba93da0b1b2.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Dispose Method

Releases all resources used by the PointCloudOverrideSettings

## Syntax (C#)
```csharp
public void Dispose()
```